Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterMulti.SetValue Method
 Sets the value specified by the index of the analysis design parameter.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetValue(
	int index,
	double value
)
Public Sub SetValue (
	index As Integer,
	value As Double
)
Parameters
index
Type: System.Int32
 The index of the value.
value
Type: System.Double
 The value.
See Also
Reference
AnalysisDesignParameterMulti Class
Tekla.Structures.Analysis Namespace